name: "UCF101_AUG_VGG16_K1FUSE4"
layers {
  name: "data"
  type: HDF5_DATA
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "data/ucf101/ucf101_fuse4_train.txt"
    batch_size: 2
  }
  include: { phase: TRAIN }
}
layers {
  name: "data"
  type: HDF5_DATA
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "data/ucf101/ucf101_fuse4_train.txt"
    batch_size: 1
  }
  include: { phase: TEST }
}
layers {
  name: "slicer_vframe"
  type: SLICE
  bottom: "data"
  ## N x 12 x W x H
  top: "data_t1"
  top: "data_t2"
  top: "data_t3"
  top: "data_t4"
  slice_param {
    slice_dim: 1
    slice_point: 3
    slice_point: 6
    slice_point: 9
  }
}
layers {
  bottom: "data_t1"
  bottom: "data_t2"
  bottom: "data_t3"
  bottom: "data_t4"
  top: "conv1_1_t1"
  top: "conv1_1_t2"
  top: "conv1_1_t3"
  top: "conv1_1_t4"
  name: "conv1_1"
  type: CONVOLUTION
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3 
  }
}
layers {
  bottom: "conv1_1_t1"
  bottom: "conv1_1_t2"
  bottom: "conv1_1_t3"
  bottom: "conv1_1_t4"
  top: "conv1_1_t1"
  top: "conv1_1_t2"
  top: "conv1_1_t3"
  top: "conv1_1_t4"
  name: "relu1_1"
  type: RELU
}

layers {
  bottom: "conv1_1_t1"
  bottom: "conv1_1_t2"
  bottom: "conv1_1_t3"
  bottom: "conv1_1_t4"
  top: "conv1_2_t1"
  top: "conv1_2_t2"
  top: "conv1_2_t3"
  top: "conv1_2_t4"
  name: "conv1_2"
  type: CONVOLUTION
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv1_2_t1"
  bottom: "conv1_2_t2"
  bottom: "conv1_2_t3"
  bottom: "conv1_2_t4"
  top: "conv1_2_t1"
  top: "conv1_2_t2"
  top: "conv1_2_t3"
  top: "conv1_2_t4"
  name: "relu1_2"
  type: RELU
}
layers {
  bottom: "conv1_2_t1"
  top: "pool1_t1"
  name: "pool1_t1"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv1_2_t2"
  top: "pool1_t2"
  name: "pool1_t2"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv1_2_t3"
  top: "pool1_t3"
  name: "pool1_t3"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv1_2_t4"
  top: "pool1_t4"
  name: "pool1_t4"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "pool1_t1"
  bottom: "pool1_t2"
  bottom: "pool1_t3"
  bottom: "pool1_t4"
  top: "conv2_1_t1"
  top: "conv2_1_t2"
  top: "conv2_1_t3"
  top: "conv2_1_t4"
  name: "conv2_1"
  type: CONVOLUTION
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv2_1_t1"
  bottom: "conv2_1_t2"
  bottom: "conv2_1_t3"
  bottom: "conv2_1_t4"
  top: "conv2_1_t1"
  top: "conv2_1_t2"
  top: "conv2_1_t3"
  top: "conv2_1_t4"
  name: "relu2_1"
  type: RELU
}
layers {
  bottom: "conv2_1_t1"
  bottom: "conv2_1_t2"
  bottom: "conv2_1_t3"
  bottom: "conv2_1_t4"
  top: "conv2_2_t1"
  top: "conv2_2_t2"
  top: "conv2_2_t3"
  top: "conv2_2_t4"
  name: "conv2_2"
  type: CONVOLUTION
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv2_2_t1"
  bottom: "conv2_2_t2"
  bottom: "conv2_2_t3"
  bottom: "conv2_2_t4"
  top: "conv2_2_t1"
  top: "conv2_2_t2"
  top: "conv2_2_t3"
  top: "conv2_2_t4"
  name: "relu2_2"
  type: RELU
}
layers {
  bottom: "conv2_2_t1"
  top: "pool2_t1"
  name: "pool2_t1"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv2_2_t2"
  top: "pool2_t2"
  name: "pool2_t2"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv2_2_t3"
  top: "pool2_t3"
  name: "pool2_t3"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv2_2_t4"
  top: "pool2_t4"
  name: "pool2_t4"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "pool2_t1"
  bottom: "pool2_t2"
  bottom: "pool2_t3"
  bottom: "pool2_t4"
  top: "conv3_1_t1"
  top: "conv3_1_t2"
  top: "conv3_1_t3"
  top: "conv3_1_t4"
  name: "conv3_1"
  type: CONVOLUTION
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv3_1_t1"
  bottom: "conv3_1_t2"
  bottom: "conv3_1_t3"
  bottom: "conv3_1_t4"
  top: "conv3_1_t1"
  top: "conv3_1_t2"
  top: "conv3_1_t3"
  top: "conv3_1_t4"
  name: "relu3_1"
  type: RELU
}
layers {
  bottom: "conv3_1_t1"
  bottom: "conv3_1_t2"
  bottom: "conv3_1_t3"
  bottom: "conv3_1_t4"
  top: "conv3_2_t1"
  top: "conv3_2_t2"
  top: "conv3_2_t3"
  top: "conv3_2_t4"
  name: "conv3_2"
  type: CONVOLUTION
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv3_2_t1"
  bottom: "conv3_2_t2"
  bottom: "conv3_2_t3"
  bottom: "conv3_2_t4"
  top: "conv3_2_t1"
  top: "conv3_2_t2"
  top: "conv3_2_t3"
  top: "conv3_2_t4"
  name: "relu3_2"
  type: RELU
}
layers {
  bottom: "conv3_2_t1"
  bottom: "conv3_2_t2"
  bottom: "conv3_2_t3"
  bottom: "conv3_2_t4"
  top: "conv3_3_t1"
  top: "conv3_3_t2"
  top: "conv3_3_t3"
  top: "conv3_3_t4"
  name: "conv3_3"
  type: CONVOLUTION
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv3_3_t1"
  bottom: "conv3_3_t2"
  bottom: "conv3_3_t3"
  bottom: "conv3_3_t4"
  top: "conv3_3_t1"
  top: "conv3_3_t2"
  top: "conv3_3_t3"
  top: "conv3_3_t4"
  name: "relu3_3"
  type: RELU
}
layers {
  bottom: "conv3_3_t1"
  top: "pool3_t1"
  name: "pool3_t1"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv3_3_t2"
  top: "pool3_t2"
  name: "pool3_t2"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv3_3_t3"
  top: "pool3_t3"
  name: "pool3_t3"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv3_3_t4"
  top: "pool3_t4"
  name: "pool3_t4"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "pool3_t1"
  bottom: "pool3_t2"
  bottom: "pool3_t3"
  bottom: "pool3_t4"
  top: "conv4_1_t1"
  top: "conv4_1_t2"
  top: "conv4_1_t3"
  top: "conv4_1_t4"
  name: "conv4_1"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv4_1_t1"
  bottom: "conv4_1_t2"
  bottom: "conv4_1_t3"
  bottom: "conv4_1_t4"
  top: "conv4_1_t1"
  top: "conv4_1_t2"
  top: "conv4_1_t3"
  top: "conv4_1_t4"
  name: "relu4_1"
  type: RELU
}
layers {
  bottom: "conv4_1_t1"
  bottom: "conv4_1_t2"
  bottom: "conv4_1_t3"
  bottom: "conv4_1_t4"
  top: "conv4_2_t1"
  top: "conv4_2_t2"
  top: "conv4_2_t3"
  top: "conv4_2_t4"
  name: "conv4_2"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv4_2_t1"
  bottom: "conv4_2_t2"
  bottom: "conv4_2_t3"
  bottom: "conv4_2_t4"
  top: "conv4_2_t1"
  top: "conv4_2_t2"
  top: "conv4_2_t3"
  top: "conv4_2_t4"
  name: "relu4_2"
  type: RELU
}
layers {
  bottom: "conv4_2_t1"
  bottom: "conv4_2_t2"
  bottom: "conv4_2_t3"
  bottom: "conv4_2_t4"
  top: "conv4_3_t1"
  top: "conv4_3_t2"
  top: "conv4_3_t3"
  top: "conv4_3_t4"
  name: "conv4_3"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv4_3_t1"
  bottom: "conv4_3_t2"
  bottom: "conv4_3_t3"
  bottom: "conv4_3_t4"
  top: "conv4_3_t1"
  top: "conv4_3_t2"
  top: "conv4_3_t3"
  top: "conv4_3_t4"
  name: "relu4_3"
  type: RELU
}
layers {
  bottom: "conv4_3_t1"
  top: "pool4_t1"
  name: "pool4_t1"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv4_3_t2"
  top: "pool4_t2"
  name: "pool4_t2"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv4_3_t3"
  top: "pool4_t3"
  name: "pool4_t3"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv4_3_t4"
  top: "pool4_t4"
  name: "pool4_t4"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "pool4_t1"
  bottom: "pool4_t2"
  bottom: "pool4_t3"
  bottom: "pool4_t4"
  top: "conv5_1_t1"
  top: "conv5_1_t2"
  top: "conv5_1_t3"
  top: "conv5_1_t4"
  name: "conv5_1"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv5_1_t1"
  bottom: "conv5_1_t2"
  bottom: "conv5_1_t3"
  bottom: "conv5_1_t4"
  top: "conv5_1_t1"
  top: "conv5_1_t2"
  top: "conv5_1_t3"
  top: "conv5_1_t4"
  name: "relu5_1"
  type: RELU
}
layers {
  bottom: "conv5_1_t1"
  bottom: "conv5_1_t2"
  bottom: "conv5_1_t3"
  bottom: "conv5_1_t4"
  top: "conv5_2_t1"
  top: "conv5_2_t2"
  top: "conv5_2_t3"
  top: "conv5_2_t4"
  name: "conv5_2"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv5_2_t1"
  bottom: "conv5_2_t2"
  bottom: "conv5_2_t3"
  bottom: "conv5_2_t4"
  top: "conv5_2_t1"
  top: "conv5_2_t2"
  top: "conv5_2_t3"
  top: "conv5_2_t4"
  name: "relu5_2"
  type: RELU
}
layers {
  bottom: "conv5_2_t1"
  bottom: "conv5_2_t2"
  bottom: "conv5_2_t3"
  bottom: "conv5_2_t4"
  top: "conv5_3_t1"
  top: "conv5_3_t2"
  top: "conv5_3_t3"
  top: "conv5_3_t4"
  name: "conv5_3"
  type: CONVOLUTION
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layers {
  bottom: "conv5_3_t1"
  bottom: "conv5_3_t2"
  bottom: "conv5_3_t3"
  bottom: "conv5_3_t4"
  top: "conv5_3_t1"
  top: "conv5_3_t2"
  top: "conv5_3_t3"
  top: "conv5_3_t4"
  name: "relu5_3"
  type: RELU
}
layers {
  bottom: "conv5_3_t1"
  top: "pool5_t1"
  name: "pool5_t1"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv5_3_t2"
  top: "pool5_t2"
  name: "pool5_t2"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv5_3_t3"
  top: "pool5_t3"
  name: "pool5_t3"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "conv5_3_t4"
  top: "pool5_t4"
  name: "pool5_t4"
  type: POOLING
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  bottom: "pool5_t1"
  bottom: "pool5_t2"
  bottom: "pool5_t3"
  bottom: "pool5_t4"
  top: "fc6_t1"
  top: "fc6_t2"
  top: "fc6_t3"
  top: "fc6_t4"
  name: "fc6"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 4096 
  }
}
layers {
  bottom: "fc6_t1"
  bottom: "fc6_t2"
  bottom: "fc6_t3"
  bottom: "fc6_t4"
  top: "fc6_t1"
  top: "fc6_t2"
  top: "fc6_t3"
  top: "fc6_t4"
  name: "relu6"
  type: RELU
}
layers {
  bottom: "fc6_t1"
  bottom: "fc6_t2"
  bottom: "fc6_t3"
  bottom: "fc6_t4"
  top: "fc6_t1"
  top: "fc6_t2"
  top: "fc6_t3"
  top: "fc6_t4"
  name: "drop6"
  type: DROPOUT
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  bottom: "fc6_t1"
  bottom: "fc6_t2"
  bottom: "fc6_t3"
  bottom: "fc6_t4"
  top: "fc7_t1"
  top: "fc7_t2"
  top: "fc7_t3"
  top: "fc7_t4"
  name: "fc7"
  type: INNER_PRODUCT
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 4096 
  }
}
layers {
  bottom: "fc7_t1"
  bottom: "fc7_t2"
  bottom: "fc7_t3"
  bottom: "fc7_t4"
  top: "fc7_t1"
  top: "fc7_t2"
  top: "fc7_t3"
  top: "fc7_t4"
  name: "relu7"
  type: RELU
}
layers {
  bottom: "fc7_t1"
  bottom: "fc7_t2"
  bottom: "fc7_t3"
  bottom: "fc7_t4"
  top: "fc7_t1"
  top: "fc7_t2"
  top: "fc7_t3"
  top: "fc7_t4"
  name: "drop7"
  type: DROPOUT
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  bottom: "fc7_t1"
  bottom: "fc7_t2"
  bottom: "fc7_t3"
  bottom: "fc7_t4"
  top: "fc7_cat"
  name: "concat"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  bottom: "fc7_cat"
  top: "fc8_ucf101"
  name: "fc8_ucf101"
  type: INNER_PRODUCT
  blobs_lr: 10
  blobs_lr: 20
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 101
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  bottom: "fc8_ucf101"
  bottom: "label"
  name: "loss_ucf101"
  type: SOFTMAX_LOSS
}
layers {
  name: "accuracy_ucf101"
  type: ACCURACY
  bottom: "fc8_ucf101"
  bottom: "label"
  top: "accuracy_ucf101"
  include: { phase: TEST }
}
